---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.Dispose
source: html/e0078210-3be5-2183-9446-f1b56d0c1165.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryData

## Syntax (C#)
```csharp
public void Dispose()
```